ChangeTypeId Method
Overload List
Name | Description
ChangeTypeId(ElementId)
 Changes the type of the element.
ChangeTypeId(Document, ICollectionElementId, ElementId)
 Changes the type of all elements in the given set.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →